app/Controllers/AppController.php

    public function home()
    {
        $judul_foto = $this->request->getVar("judul_foto");
        if ($judul_foto == null) {
            $rows = $this->fotoModel
                ->orderBy("judul_foto", "asc")
                ->FindAll();
        } else {
            $rows = $this->fotoModel
                ->orderBy("judul_foto", "asc")
                ->like("judul_foto", $judul_foto)
                ->findall();
        }
        $rows1 = $this->albumModel
                ->orderBy("album_id", "asc")
                ->FindAll();
---
SELECT *
FROM `foto`
ORDER BY `judul_foto` ASC
SELECT *
FROM `album`
ORDER BY `album_id` ASC

    public function proses_edit_foto()
    {
        $foto_id           = $this->request->getpost("foto_id");
        $judul_foto         = $this->request->getpost("judul_foto");
        $deskripsi_foto     = $this->request->getpost("deskripsi_foto");
        $tanggal_unggah     = date("Y-m-d");
        $album_id           = $this->request->getpost("album_id");
        $user_id            = $this->session->user_id;

        if ($this->request->getFile("lokasi_file")->getName() != NULL) {
            $lokasi_file = $this->request->getFile("lokasi_file");
            $namafoto = $foto_id . "_" . $lokasi_file->getRandomName();

            $lokasi_file->move("assets/foto", $namafoto);
            $this->fotoModel
                ->where("foto_id", $foto_id)
                ->set([
                    "foto_id"        => $foto_id,
                    "judul_foto"        => $judul_foto,
                    "deskripsi_foto"    => $deskripsi_foto,
                    "tanggal_unggah"    => $tanggal_unggah,
                    "album_id"          => $album_id,
                    "user_id"           => $user_id,
                    "lokasi_file"       => $namafoto

                ])->update();
        } else {
            $this->fotoModel
                ->where("foto_id", $foto_id)
                ->set([
                    "foto_id"        => $foto_id,
                    "judul_foto"        => $judul_foto,
                    "deskripsi_foto"    => $deskripsi_foto,
                    "tanggal_unggah"    => $tanggal_unggah,
                    "album_id"          => $album_id,
                    "user_id"           => $user_id,

                ])->update();
---
UPDATE `foto` SET `foto_id` = '59', `judul_foto` = 'kjxn', `deskripsi_foto` = 'ksncj', `tanggal_unggah` = '2024-02-19', `album_id` = '', `user_id` = '1'
WHERE `foto_id` = '59'

    public function preview_foto($foto_id)
    {
        $userId = session()->user_id;

        $foto = $this->fotoModel
            ->join("user", "user.user_id=foto.user_id", "left")
            ->where("foto_id", $foto_id)
            ->first();

        $rows1 = $this->albumModel
            ->orderBy("album_id", "asc")
            ->FindAll();
        $komentar = $this->komentarModel
            ->where("foto_id", $foto_id)
            ->findall();

        $usernames = array();

        foreach ($komentar as $comment) {
            $user_id = $comment->user_id;
            $user = $this->userModel
                ->where("user_id", $user_id)
                ->first();
---
SELECT *
FROM `foto`
LEFT JOIN `user` ON `user`.`user_id`=`foto`.`user_id`
WHERE `foto_id` = '47'
 LIMIT 1
SELECT *
FROM `album`
ORDER BY `album_id` ASC
SELECT *
FROM `user`
WHERE `user_id` = '7'
 LIMIT 1